#Информатика  #python 
### Задача

Миша заполнял таблицу истинности логической функции F=(x∨y)∧¬(y≡z)∧¬w F=(x∨y)∧¬(y≡z)∧¬w , но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w,x,y,zw,x,y,z.

|   |   |   |   |   |
|---|---|---|---|---|
|||||**F**|
|1||1||**1**|
|0|1||0|**1**|
||1|1|0|**1**|

Определите, какому столбцу таблицы соответствует каждая из переменных w,x,y,zw,x,y,z.  
В ответе напишите буквы w,x,y,zw,x,y,z в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т.д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
### Решение

Задачу можно решить в два этапа: написать код на ЯП, в моем случай Питон и подставить полученные знания в таблицу, согласно условиям задачи и их порядку.

```python
x , y , z , w = 0,0,0,0
for x in [0,1]:
    for y in  [0,1]:
        for z in  [0,1]:
            for w in  [0,1]:
                v = (x or y) and not (y == z and not (w))
                if v == True:
                    print(x,y,z,w)
```

Данный код позволяет решить указанную задачу и схожие по типу. Работает по принципу перебора всех возможных значений для указанных переменных в логическом выражении. Так, сначала $x = 0, y = 0, z = 0,w = 0$. Затем значение $z$ при итерации цикла увеличивается на 1. Затем для остальных значений происходит тоже самое. При этом, когда значение верхнего цикла (родительского) увеличивается на один, весь код внутри повторяется, т.е. вложенные (дочерние) циклы будут воспроизводить заново.

Когда логическое выражение при подстановке значений переменных будет возвращать значение (истина, в нашем случае), мы выведем значение этих переменных на экран.
Полученные в результате работы программы значения можно логически расставить по своим местам в таблице, опираясь на кол-во 0 и 1 в столбцах и значений уже известных.
$(_{)_{)_{)_{)_{(_{(_{{{)))))))))))}}))))})})}})})})}$  